RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/drivers/drv_uart.c
    return RT_EOK;
}

static rt_err_t imxrt_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        DisableIRQ(uart->irqn);
        break;

    case RT_DEVICE_CTRL_SET_INT:
        LPUART_EnableInterrupts(uart->uart_base, kLPUART_RxDataRegFullInterruptEnable);
        NVIC_SetPriority(uart->irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 4, 0));
        EnableIRQ(uart->irqn);
        break;

    case RT_DEVICE_CTRL_CONFIG:
    {
        rt_ubase_t ctrl_arg = (rt_ubase_t)arg;

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
        if (RT_DEVICE_FLAG_DMA_RX == ctrl_arg)
        {
            imxrt_dma_rx_config(uart);
            break;
        }
        if (RT_DEVICE_FLAG_DMA_TX == ctrl_arg)
        {
            imxrt_dma_tx_config(uart);
            break;
        }
#endif

#ifdef RT_USING_SERIAL_V2
        if (RT_DEVICE_FLAG_RX_BLOCKING == ctrl_arg || RT_DEVICE_FLAG_RX_NON_BLOCKING == ctrl_arg)
        {
            LPUART_EnableInterrupts(uart->uart_base, kLPUART_RxDataRegFullInterruptEnable);
            NVIC_SetPriority(uart->irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 4, 0));
            EnableIRQ(uart->irqn);
            break;
        }
        if (RT_DEVICE_FLAG_TX_BLOCKING == ctrl_arg || RT_DEVICE_FLAG_TX_NON_BLOCKING == ctrl_arg)
        {
            LPUART_EnableInterrupts(uart->uart_base, kLPUART_TxDataRegEmptyInterruptEnable);
            NVIC_SetPriority(uart->irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 4, 0));
            EnableIRQ(uart->irqn);
            break;
        }
#endif
        break;
    }

#ifdef RT_USING_SERIAL_V2
    case RT_DEVICE_CHECK_OPTMODE:
        if (uart->dma_flag & RT_DEVICE_FLAG_DMA_TX)
            return RT_SERIAL_TX_BLOCKING_NO_BUFFER;
        return RT_SERIAL_TX_BLOCKING_BUFFER;
#endif
    }

    return RT_EOK;
}

static int imxrt_putc(struct rt_serial_device *serial, char ch)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    LPUART_WriteByte(uart->uart_base, ch);
    while (!(LPUART_GetStatusFlags(uart->uart_base) & kLPUART_TxDataRegEmptyFlag));

    return 1;
}

static int imxrt_getc(struct rt_serial_device *serial)
{
    int ch;
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    ch = -1;
    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxDataRegFullFlag)
    {
        ch = LPUART_ReadByte(uart->uart_base);
    }

    return ch;
}

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)

#ifdef RT_USING_SERIAL_V2
static rt_ssize_t imxrt_transmit(struct rt_serial_device *serial,
                                  rt_uint8_t *buf, rt_size_t size, rt_uint32_t tx_flag)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    if (uart->dma_flag & RT_DEVICE_FLAG_DMA_TX)
    {
        lpuart_transfer_t xfer;
        RT_ASSERT(buf != RT_NULL);
        xfer.data = buf;
        xfer.dataSize = size;
        if (LPUART_SendEDMA(uart->uart_base, &uart->dma_tx->uart_edma, &xfer) == kStatus_Success)
            return (rt_ssize_t)size;
        return -RT_EIO;
    }

    if (size == 0)
    {
        LPUART_EnableInterrupts(uart->uart_base, kLPUART_TxDataRegEmptyInterruptEnable);
        return 0;
    }

    {
        rt_uint8_t *ptr = buf;
        while (size--)
        {
            LPUART_WriteByte(uart->uart_base, *ptr++);
            while (!(LPUART_GetStatusFlags(uart->uart_base) & kLPUART_TxDataRegEmptyFlag));
        }
        return (rt_ssize_t)(ptr - buf);
    }
}
#else
static rt_ssize_t dma_tx_xfer(struct rt_serial_device *serial, rt_uint8_t *buf, rt_size_t size, int direction)
{
    struct imxrt_uart *uart;
    lpuart_transfer_t xfer;
    rt_size_t xfer_size = 0;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    if (0 != size)
    {
        if (RT_SERIAL_DMA_TX == direction)
        {
            xfer.data = buf;
            xfer.dataSize = size;
            if (LPUART_SendEDMA(uart->uart_base, &uart->dma_tx->uart_edma, &xfer) == kStatus_Success)
                xfer_size = size;
        }
    }

    return xfer_size;
}
#endif

#endif

static const struct rt_uart_ops imxrt_uart_ops =
{
#ifdef RT_USING_SERIAL_V2
    imxrt_configure,
    imxrt_control,
    imxrt_putc,
    imxrt_getc,
    imxrt_transmit,
#else
    imxrt_configure,
    imxrt_control,
    imxrt_putc,
    imxrt_getc,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    dma_tx_xfer
#else
    RT_NULL
#endif
#endif
};

int rt_hw_uart_init(void)
{
    int i;
    rt_err_t ret = RT_EOK;

#ifdef RT_USING_SERIAL_V2
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
#else
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
    rt_uint32_t flag;
    flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;
#endif

    uart_get_dma_config();

    for (i = 0; i < sizeof(uarts) / sizeof(uarts[0]); i++)
    {
        uarts[i].serial.ops    = &imxrt_uart_ops;
        uarts[i].serial.config = config;

#ifdef RT_USING_SERIAL_V2
        ret = rt_hw_serial_register(&uarts[i].serial, uarts[i].name,
                                     RT_DEVICE_FLAG_RDWR, NULL);
#else
        ret = rt_hw_serial_register(&uarts[i].serial, uarts[i].name,
                                     flag | uarts[i].dma_flag, NULL);
#endif
    }

    return ret;
}
INIT_BOARD_EXPORT(rt_hw_uart_init);

#endif /* BSP_USING_LPUART */
